const typoList = [
    ['กรองเครื่อง', 'กค', 'กค.'],
    ['สายพาน', 'สพ', 'สพ.'],
    ['น้ำมันเครื่อง', 'นมค', 'นมค.'],
    ['กรองโซล่า', 'กรองโซลา', 'กรองโซลาร์', 'กซ', 'กซ.'],
    ['ปั้ม', 'ปั๊ม'],
    ['ชาร์จ', 'ชาจ', 'ชาร์ท', 'ชาร์ท'],
    ['คอย', 'คอล์ย', 'คอยล์'],
    ['น้ำยา', 'นย', 'นย.'],
    ['ผ้าเบรค', 'ผ้าดิสเบรค', 'ผบ', 'ผบ.', 'ผดบ', 'ผดบ.'],
    ['ขวา', 'RH', 'R'],
    ['ซ้าย', 'LH', 'L'],
    ['ราวลิ้น', 'ไทม์มิ่ง', 'ทามมิ่ง', 'ไทม์มิง', 'ไทม์มิง', 'ไทมิ่ง', 'ไทมิง'],
    ['ไดร์', 'หน้าเครื่อง'],
    ['Honda', 'HD', 'ฮอนดา', 'ฮอนด้า'],
    ['Toyota', 'TO', 'โตโยตา', 'โตโยต้า'],
    ['ISUZU', 'IS', 'อีซูซุ'],
    ['Vios', 'วีออส'],
    ['Vigo', 'วีโก้'],
    ['คอมูเตอร์', 'คอมพิวเตอร์', 'คอมมูเตอร์', 'Commuter'],
    ['จารบี', 'จาระบี', 'จรบ', 'จรบ.'],
    ['ไอดรอลิก', 'ไฮโดรลิก', 'ไอดรอลิค', 'ไฮโดรลิค', 'นมฮ', 'นมฮ.'],
    ['สปเรย์', 'สเปรย์'],
    ['กิฟ', 'กิ๊ฟ', 'กีบ', 'กี๊บ'],
    ['น้ำยาหล่อเย็น', 'น้ำยาหม้อน้ำ', 'หล่อเย็น'],
    ['Power', 'PW', 'พาวเวอร์', 'พาวเวอ'],
    ['มูเลย์', 'มูเล่ย์', 'มู่เล่', 'มู่เล่ย์', 'มู่เลย์', 'มูเล'],
    ['VTEC', 'V-TEC', 'วีเทค'],
    ['DuckHam', 'DH', 'ดักแฮม', 'ดั้กแฮม', 'ดั๊กแฮม'],
    ['โช้ค', 'โชค', 'โช๊ค', 'โช้ก', 'โชก', 'โช๊ก'],
    ['บูช', 'บู้ช'],
    ['น้อต', 'นอต'],
    ['แม็ก', 'แม็ค', 'แมก', 'แมค'],
    ['ลูกปืนกากบาท', 'ยอยกากบาท', 'กากบาท', 'ลป.กากบาท'],
    ['สวิตซ์', 'สวิตช์', 'SW', 'สวิต', 'สว'],
]

export const typoMap = (word: string) => {
    const result = typoList.filter((typo) => typo.includes(word)).flat()

    return result || [word]
}
